import Accordion from "./components/Accordion";

const faqData = [
  {
    question: "بروکر چیست؟",
    answer:
      "بروکر یک واسطه مالی است که امکان خرید و فروش ابزارهای مالی مانند سهام، ارز و کالا را بین خریداران و فروشندگان فراهم می‌کند.",
  },
  {
    question: "چگونه می‌توانم در بروکر حساب باز کنم؟",
    answer:
      "برای باز کردن حساب، به سایت بروکر مراجعه کنید، گزینه ثبت‌نام را انتخاب کرده، اطلاعات شخصی خود را وارد کنید و هویت خود را تأیید کنید.",
  },
  {
    question: "بروکرها چه هزینه‌هایی دریافت می‌کنند؟",
    answer:
      "بروکرها معمولاً هزینه‌هایی مانند اسپرد، کمیسیون و نرخ سوآپ را دریافت می‌کنند. پیش از شروع معامله، ساختار هزینه‌ها را بررسی کنید.",
  },
  {
    question: "چگونه می‌توانم حساب معاملاتی خود را شارژ کنم؟",
    answer:
      "برای شارژ حساب، وارد بخش مالی حساب کاربری خود شوید، روش پرداخت مورد نظر را انتخاب کنید و مبلغ مورد نظر را واریز کنید.",
  },
  {
    question: "آیا معاملات در بروکر امن است؟",
    answer:
      "امنیت معاملات بستگی به انتخاب بروکر معتبر و رگوله شده دارد. حتماً قبل از ثبت‌نام، مجوزها و نظرات کاربران را بررسی کنید.",
  },
  {
    question: "چگونه می‌توانم سود خود را برداشت کنم؟",
    answer:
      "برای برداشت سود، وارد بخش مالی شوید، درخواست برداشت وجه را ثبت کنید و روش برداشت را انتخاب کنید. زمان برداشت بسته به روش انتخابی متفاوت است.",
  },
  {
    question: "حساب دمو چیست و چگونه از آن استفاده کنم؟",
    answer:
      "حساب دمو یک حساب آزمایشی است که برای تمرین معامله‌گری بدون استفاده از پول واقعی طراحی شده است. می‌توانید با ثبت‌نام در بروکر، به راحتی حساب دمو ایجاد کنید.",
  },
];

function App() {
  return (
    <div className="min-h-screen bg-gradient-to-r from-slate-900 via-gray-800 flex items-center">
      <Accordion questions={faqData} />
    </div>
  );
}

export default App;

// <div className="min-h-screen bg-gradient-to-r from-gray-900 via-gray-800 to-gray-900 flex items-center justify-center">
